package main

import (
	"fmt"
)

/*
	Задание 1. Подсчёт определителя

Что нужно сделать
Напишите функцию, вычисляющую определитель матрицы размером 3 × 3.

===========================================

Задание 2. Умножение матриц
Что нужно сделать
Напишите функцию, умножающую две матрицы размерами 3 × 5 и 5 × 4.
*/

var m1 = [3][3]int{{1, -2, 5}, {4, -1, 15}, {2, 2, 3}}

func det3x3([3][3]int) (d int) {

	d = m1[0][0]*m1[1][1]*m1[2][2] -
		m1[0][0]*m1[1][2]*m1[2][1] -
		m1[0][1]*m1[1][0]*m1[2][2] +
		m1[0][1]*m1[1][2]*m1[2][0] +
		m1[0][2]*m1[1][0]*m1[2][1] -
		m1[0][2]*m1[1][1]*m1[2][0]
	return
}

func mMultiplier(mtrx1 [3][5]int, mtrx2 [5][4]int) [][]int {

	mtrx3 := make([][]int, len(mtrx1))
	for i := 0; i < len(mtrx1); i++ {
		mtrx3[i] = make([]int, len(mtrx2[0]))
		for j := 0; j < len(mtrx2[0]); j++ {
			for k := 0; k < len(mtrx2); k++ {
				mtrx3[i][j] += mtrx1[i][k] * mtrx2[k][j]
			}
		}
	}
	return mtrx3

}

func main() {
	fmt.Println("Раздел 20. Подсчет определителя и умножение матриц.")
	fmt.Printf("Детерминант для матрицы размером 3х3 \n%v\n равен %v\n ", m1, det3x3(m1))

	var mtrx1 = [3][5]int{{3, 1, 3, 2, 0}, {5, 8, 1, 8, 6}, {2, 4, 1, 9, 5}}
	var mtrx2 = [5][4]int{{1, 8, 1, 2}, {2, 1, 1, 2}, {5, 0, 3, 3}, {3, 9, 6, 2}, {4, 3, 2, 5}}

	fmt.Printf("\nРезультат умножения матрицы \n%v\n на матрицу\n%v\n равен:\n%v", mtrx1, mtrx2, mMultiplier(mtrx1, mtrx2))
}
